%% 输出反馈 Hinfinty 控制

% A = [0 1; 1 0];
% B_1 = [0; 1];
% B_2 = [1; 1];
% C_1 = [1 0];
% D_11 = 0;
% D_12 = 0;
% C_2 = [1 0];
% D_21 = 0;
% D_22 = 0;
A = [2 2 2; 0 1 0; 0 0 2];
B_1 = [1 0 0]';
B_2 = [1 0; 0 0.87; 0 0];
C_1 = [1.31 0 0; 0 0 1];
C_2 = [1 0.51 0; 0 0 1];
D_11 = [0; 0];
D_12 = [0 0; 0 0];
D_21 = [0; 0];
D_22 = [0 0; 0 0];


B = [B_1 B_2];
C = [C_1; C_2];
D = [D_11 D_12; D_21 D_22];
G = ltisys(A, B, C, D);
[gopt, K] = hinflmi(G, [3 2])
[Ak,Bk,Ck,Dk] = ltiss(K)
% K = pck(Ak, Bk, Ck, Dk);

% clsys = slft(G, K);	% 闭环系统clsys
% spol(clsys);		% 返回闭环系统的极点，检验稳定性
% norminf(clsys);		% 返回EE增益
[kdum,kden] = ss2tf(Ak,Bk,Ck,Dk);%控制器传递函数的分子分母

ktf = tf(kdum,kden);%控制器的传递函数形式
clsys = slft(G,K);%闭环系统传递函数
spol(clsys);%闭环系统极点，用于检验闭环系统稳定性
norminf(clsys);%外部扰动w到被调输出的闭环系统RMS/ee增益
figure(1);splot(clsys,'st');%闭环系统时域响应阶跃图
figure(2);splot(clsys,'bo');%闭环系统频域响应伯德图

%% 最终的控制效果不尽人意，
% 关键是从网上并不能找到一个实际控制一个系统的例子，
% 只有最后的系统稳定性的分析，
% 自己突发奇想做的一个实验，最后没做好也是可惜，
% 只能说对控制器的理解不够深吧，过段时间再看看吧

